benchmark/results/v0.7/baseline-pre-v0.7/RAW/flare-plaintext-throughput-run1.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread calibration: mean lat.: 1.260ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms  755.12us  12.40ms   73.01%
    Req/Sec    67.06k     6.74k   88.00k    55.51%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.19ms
 75.000%    1.73ms
 90.000%    2.31ms
 99.000%    3.09ms
 99.900%    8.17ms
 99.990%   11.44ms
 99.999%   12.18ms
100.000%   12.41ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.045     0.000000            1         1.00
       0.512     0.100000       125592         1.11
       0.673     0.200000       250389         1.25
       0.827     0.300000       375580         1.43
       0.998     0.400000       501035         1.67
       1.189     0.500000       626171         2.00
       1.293     0.550000       689115         2.22
       1.395     0.600000       751194         2.50
       1.502     0.650000       813907         2.86
       1.615     0.700000       876492         3.33
       1.734     0.750000       939435         4.00
       1.796     0.775000       970469         4.44
       1.865     0.800000      1001645         5.00
       1.946     0.825000      1032852         5.71
       2.047     0.850000      1064232         6.67
       2.173     0.875000      1095829         8.00
       2.241     0.887500      1111335         8.89
       2.313     0.900000      1126775        10.00
       2.393     0.912500      1142631        11.43
       2.475     0.925000      1158350        13.33
       2.559     0.937500      1173668        16.00
       2.605     0.943750      1181628        17.78
       2.651     0.950000      1189441        20.00
       2.697     0.956250      1197229        22.86
       2.749     0.962500      1205150        26.67
       2.805     0.968750      1212770        32.00
       2.837     0.971875      1216753        35.56
       2.869     0.975000      1220669        40.00
       2.905     0.978125      1224519        45.71
       2.945     0.981250      1228510        53.33
       2.989     0.984375      1232403        64.00
       3.013     0.985938      1234346        71.11
       3.039     0.987500      1236247        80.00
       3.069     0.989062      1238313        91.43
       3.101     0.990625      1240158       106.67
       3.143     0.992188      1242123       128.00
       3.167     0.992969      1243102       142.22
       3.193     0.993750      1244063       160.00
       3.225     0.994531      1245067       182.86
       3.261     0.995313      1246059       213.33
       3.303     0.996094      1246996       256.00
       3.331     0.996484      1247484       284.44
       3.365     0.996875      1247983       320.00
       3.417     0.997266      1248463       365.71
       3.637     0.997656      1248943       426.67
       4.967     0.998047      1249432       512.00
       5.635     0.998242      1249676       568.89
       6.311     0.998437      1249921       640.00
       6.991     0.998633      1250165       731.43
       7.599     0.998828      1250409       853.33
       8.263     0.999023      1250654      1024.00
       8.567     0.999121      1250776      1137.78
       8.903     0.999219      1250899      1280.00
       9.255     0.999316      1251024      1462.86
       9.575     0.999414      1251143      1706.67
       9.951     0.999512      1251265      2048.00
      10.167     0.999561      1251327      2275.56
      10.359     0.999609      1251390      2560.00
      10.583     0.999658      1251450      2925.71
      10.727     0.999707      1251513      3413.33
      10.887     0.999756      1251572      4096.00
      10.975     0.999780      1251603      4551.11
      11.063     0.999805      1251633      5120.00
      11.143     0.999829      1251663      5851.43
      11.231     0.999854      1251693      6826.67
      11.335     0.999878      1251725      8192.00
      11.407     0.999890      1251740      9102.22
      11.447     0.999902      1251755     10240.00
      11.535     0.999915      1251770     11702.86
      11.599     0.999927      1251787     13653.33
      11.655     0.999939      1251802     16384.00
      11.687     0.999945      1251808     18204.44
      11.775     0.999951      1251815     20480.00
      11.839     0.999957      1251824     23405.71
      11.887     0.999963      1251831     27306.67
      11.959     0.999969      1251838     32768.00
      11.983     0.999973      1251842     36408.89
      11.999     0.999976      1251846     40960.00
      12.031     0.999979      1251850     46811.43
      12.087     0.999982      1251854     54613.33
      12.119     0.999985      1251857     65536.00
      12.135     0.999986      1251859     72817.78
      12.151     0.999988      1251861     81920.00
      12.175     0.999989      1251863     93622.86
      12.199     0.999991      1251866    109226.67
      12.207     0.999992      1251868    131072.00
      12.207     0.999993      1251868    145635.56
      12.295     0.999994      1251869    163840.00
      12.303     0.999995      1251870    187245.71
      12.335     0.999995      1251871    218453.33
      12.367     0.999996      1251873    262144.00
      12.367     0.999997      1251873    291271.11
      12.367     0.999997      1251873    327680.00
      12.367     0.999997      1251873    374491.43
      12.375     0.999998      1251874    436906.67
      12.375     0.999998      1251874    524288.00
      12.375     0.999998      1251874    582542.22
      12.383     0.999998      1251875    655360.00
      12.383     0.999999      1251875    748982.86
      12.383     0.999999      1251875    873813.33
      12.383     0.999999      1251875   1048576.00
      12.383     0.999999      1251875   1165084.44
      12.407     0.999999      1251876   1310720.00
      12.407     1.000000      1251876          inf
#[Mean    =        1.312, StdDeviation   =        0.755]
#[Max     =       12.400, Total count    =      1251876]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1844595 requests in 30.00s, 205.82MB read
Requests/sec:  61486.41
Transfer/sec:      6.86MB