benchmark/results/v0.7/baseline-pre-v0.7/RAW/flare-plaintext-throughput-run2.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread calibration: mean lat.: 1.301ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.30ms  753.16us  11.77ms   69.71%
    Req/Sec    67.35k     5.68k   82.89k    66.99%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.16ms
 75.000%    1.74ms
 90.000%    2.37ms
 99.000%    3.28ms
 99.900%    4.41ms
 99.990%    8.69ms
 99.999%   10.53ms
100.000%   11.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.036     0.000000            1         1.00
       0.465     0.100000       125465         1.11
       0.628     0.200000       251177         1.25
       0.786     0.300000       376094         1.43
       0.963     0.400000       500797         1.67
       1.157     0.500000       626415         2.00
       1.264     0.550000       688800         2.22
       1.374     0.600000       751644         2.50
       1.484     0.650000       814037         2.86
       1.606     0.700000       876769         3.33
       1.744     0.750000       938963         4.00
       1.817     0.775000       970400         4.44
       1.894     0.800000      1001594         5.00
       1.981     0.825000      1033067         5.71
       2.083     0.850000      1064148         6.67
       2.209     0.875000      1095652         8.00
       2.285     0.887500      1111379         8.89
       2.371     0.900000      1126884        10.00
       2.467     0.912500      1142592        11.43
       2.561     0.925000      1158065        13.33
       2.661     0.937500      1173878        16.00
       2.713     0.943750      1181488        17.78
       2.773     0.950000      1189503        20.00
       2.835     0.956250      1197297        22.86
       2.901     0.962500      1205113        26.67
       2.967     0.968750      1212766        32.00
       3.003     0.971875      1216801        35.56
       3.039     0.975000      1220737        40.00
       3.077     0.978125      1224643        45.71
       3.119     0.981250      1228452        53.33
       3.167     0.984375      1232350        64.00
       3.195     0.985938      1234353        71.11
       3.225     0.987500      1236236        80.00
       3.257     0.989062      1238286        91.43
       3.289     0.990625      1240188       106.67
       3.325     0.992188      1242208       128.00
       3.341     0.992969      1243091       142.22
       3.359     0.993750      1244089       160.00
       3.379     0.994531      1245079       182.86
       3.401     0.995313      1246083       213.33
       3.427     0.996094      1247061       256.00
       3.439     0.996484      1247492       284.44
       3.455     0.996875      1248014       320.00
       3.473     0.997266      1248470       365.71
       3.493     0.997656      1248948       426.67
       3.521     0.998047      1249449       512.00
       3.539     0.998242      1249701       568.89
       3.561     0.998437      1249929       640.00
       3.595     0.998633      1250172       731.43
       3.693     0.998828      1250414       853.33
       4.507     0.999023      1250659      1024.00
       4.939     0.999121      1250780      1137.78
       5.423     0.999219      1250902      1280.00
       5.867     0.999316      1251025      1462.86
       6.283     0.999414      1251147      1706.67
       6.695     0.999512      1251270      2048.00
       6.875     0.999561      1251330      2275.56
       7.087     0.999609      1251391      2560.00
       7.339     0.999658      1251453      2925.71
       7.583     0.999707      1251516      3413.33
       7.755     0.999756      1251575      4096.00
       7.879     0.999780      1251606      4551.11
       7.999     0.999805      1251636      5120.00
       8.167     0.999829      1251667      5851.43
       8.407     0.999854      1251697      6826.67
       8.551     0.999878      1251728      8192.00
       8.639     0.999890      1251743      9102.22
       8.719     0.999902      1251758     10240.00
       8.839     0.999915      1251775     11702.86
       8.951     0.999927      1251791     13653.33
       9.023     0.999939      1251804     16384.00
       9.079     0.999945      1251812     18204.44
       9.127     0.999951      1251819     20480.00
       9.255     0.999957      1251830     23405.71
       9.303     0.999963      1251836     27306.67
       9.415     0.999969      1251842     32768.00
       9.511     0.999973      1251849     36408.89
       9.519     0.999976      1251850     40960.00
       9.599     0.999979      1251855     46811.43
       9.623     0.999982      1251858     54613.33
       9.671     0.999985      1251861     65536.00
      10.087     0.999986      1251863     72817.78
      10.303     0.999988      1251865     81920.00
      10.527     0.999989      1251867     93622.86
      10.799     0.999991      1251869    109226.67
      11.031     0.999992      1251871    131072.00
      11.127     0.999993      1251872    145635.56
      11.167     0.999994      1251873    163840.00
      11.367     0.999995      1251874    187245.71
      11.455     0.999995      1251875    218453.33
      11.527     0.999996      1251876    262144.00
      11.527     0.999997      1251876    291271.11
      11.607     0.999997      1251878    327680.00
      11.607     0.999997      1251878    374491.43
      11.607     0.999998      1251878    436906.67
      11.607     0.999998      1251878    524288.00
      11.607     0.999998      1251878    582542.22
      11.663     0.999998      1251879    655360.00
      11.663     0.999999      1251879    748982.86
      11.663     0.999999      1251879    873813.33
      11.663     0.999999      1251879   1048576.00
      11.663     0.999999      1251879   1165084.44
      11.775     0.999999      1251880   1310720.00
      11.775     1.000000      1251880          inf
#[Mean    =        1.298, StdDeviation   =        0.753]
#[Max     =       11.768, Total count    =      1251880]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1844617 requests in 30.00s, 205.82MB read
Requests/sec:  61486.87
Transfer/sec:      6.86MB